/*
===================================================================
Παράδειγμα Υπολογισμού χρόνου εκτέλεσης ενός τμήματος προγράμματος
Η μονάδα μέτρησης... δεν έχει σημασία.
Είναι ο καλύτερος απλός τρόπος για να βγουν συμπεράσματα για τον
χρόνο εκτέλεσης ανάλογα με τις συνθήκες
Μην περιμένετε αν τρέξετε 2 φορές το ίδιο πρόγραμμα με τα ίδια
δεδομένα να πάρετε το ίδιο χρονικό αποτέλεσμα.
===================================================================
*/

#include <stdio.h>
#include <time.h>
#include <math.h>

int main (int argc, char **argv)
{

    clock_t T1, T2;
    long T;
    int i,j,S;
    
    T1 = clock ();
    //Do Something
    for (i = 1; i < 10000; i++)
        for (j = 1; j < 600; j++)
            S += pow (i, j);
    //Done
    T2 = clock ();
    T = (long) (T2 - T1);
    printf ("Time %ld\n", T);
}
